// JavaScript Document
var colorCode = 0;	//default color
var modelCode = 0; // default model
var totalPrice = 0;

var models = ["Ейша", "Феба"];
var colors = ["J1", "J2", "J3", "J4", "J5", "J6",
			  "B2", "B3", "B8", "B10", "D3", "D7", "D9", "D10", "D11",
			  "B1", "B4", "B5", "B7", "B9", "B11", "B12", "B13", "D1", "D4", "D6", "D8",
			  "B6", "D2", "D5"];

var Coeficient = [1.00, 1.35, 1.75, 2.10];

var eishaTable = [
				  [31,33,34,35,37,38,40,41,42,45,48,52,55,59,62,65,69,72,76,79,83],
				  [31,33,34,35,37,38,40,44,48,51,55,59,63,67,71,75,79,83,87,91,95],
				  [31,33,34,35,37,40,45,49,54,58,63,67,72,76,81,85,90,94,98,103,107],
				  [31,33,34,35,40,45,50,55,60,65,70,75,80,85,90,95,100,105,110,115,120],
				  [31,33,34,39,44,50,55,61,66,72,77,83,88,94,99,105,110,116,121,127,132],
				  [31,33,36,42,48,54,60,66,72,78,84,90,96,102,108,114,121,127,133,139,145],
				  [31,33,39,46,52,59,65,72,78,85,92,98,105,111,118,124,131,137,144,150,157],
				  [31,35,42,49,56,64,71,78,85,92,99,106,113,120,127,134,141,148,155,162,169],
				  [31,38,45,53,61,68,76,83,91,98,106,114,121,129,136,144,151,159,167,174,182],
				  [32,40,49,57,65,73,81,89,97,105,113,121,129,138,146,154,162,170,178,186,194],
				  [34,43,52,60,69,77,86,95,103,112,120,129,138,146,155,164,172,181,189,198,207],
				  [36,46,55,64,73,82,91,100,109,119,128,137,146,155,164,173,182,192,201,210,219],
				  [39,48,58,67,77,87,96,106,116,125,135,145,154,164,174,183,193,202,212,222,231],
				  [41,51,61,71,81,91,102,112,122,132,142,152,162,173,183,193,203,213,223,234,244],
				  [43,53,64,75,85,96,107,117,128,139,149,160,171,181,192,203,213,224,235,245,256],
				  [45,56,67,78,90,101,112,123,134,145,157,168,179,190,201,213,224,235,246,257,269],
				  [47,59,70,82,94,105,117,129,140,152,164,176,187,199,211,222,234,246,257,269,281],
				  [49,61,73,86,98,110,122,134,147,159,171,183,196,208,220,232,244,257,269,281,292],
				  [51,64,76,89,102,115,127,140,153,166,178,191,204,217,229,242,255,267,280,293,306],
				  [53,66,80,93,106,119,133,146,159,172,186,199,212,225,239,252,265,278,292,305,318],
				  [55,69,83,96,110,124,138,151,165,179,193,207,220,234,248,262,275,289,303,317,330],
				  [57,71,86,100,114,129,143,157,171,186,200,214,229,243,257,271,286,300,314,329,343]
				  ];

var febaTable = [
				  [33,34,36,38,39,41,43,44,46,49,52,56,60,64,67,71,75,79,82,86,90],
				  [33,34,36,38,39,41,43,47,51,55,60,64,68,72,77,81,85,90,94,98,102],
				  [33,34,36,38,39,43,48,53,57,62,67,72,76,81,86,91,96,100,105,110,115],
				  [33,34,36,38,42,48,53,58,64,69,74,79,85,90,95,101,106,111,117,122,127],
				  [33,34,36,41,47,52,58,64,70,76,81,87,93,99,105,110,116,122,128,134,140],
				  [33,34,38,44,51,57,63,70,76,82,89,95,101,108,114,120,127,133,139,146,152],
				  [33,34,41,48,55,62,68,75,82,89,96,103,110,116,123,130,137,144,151,157,164],
				  [33,37,44,52,59,66,74,81,88,96,103,110,118,125,133,140,147,155,162,169,177],
				  [33,39,47,55,63,71,79,87,95,102,110,118,126,134,142,150,158,165,173,181,189],
				  [34,42,50,59,67,76,84,92,101,109,118,126,134,143,151,159,168,176,185,193,201],
				  [36,45,53,62,71,80,89,98,107,116,125,134,143,151,160,169,178,187,196,205,214],
				  [38,47,57,66,75,85,94,104,113,123,132,141,151,160,170,179,189,198,207,217,226],
				  [40,50,60,70,80,89,99,109,119,129,139,149,159,169,179,189,199,209,219,229,239],
				  [42,52,63,73,84,94,105,115,126,136,146,157,167,178,188,199,209,220,230,241,251],
				  [44,55,66,77,88,99,110,121,132,143,154,165,176,187,198,209,220,230,241,252,263],
				  [46,57,69,80,92,103,115,126,138,149,161,172,184,195,207,218,230,241,253,264,276],
				  [48,60,72,84,96,108,120,132,144,156,168,180,192,204,216,228,240,252,264,276,288],
				  [50,63,75,88,100,113,125,138,150,163,175,188,200,213,225,238,250,263,276,288,301],
				  [52,65,78,91,104,117,130,143,156,170,183,196,209,222,235,248,261,274,287,300,313],
				  [54,68,81,95,108,122,136,149,163,176,190,203,217,230,244,258,271,285,298,312,325],
				  [56,70,84,99,113,127,141,155,169,183,197,211,225,239,253,267,281,296,310,324,338],
				  [58,73,88,102,117,131,146,160,175,190,204,219,233,248,263,277,292,306,321,336,350]
				 ];

function printOption(option)
{
	for (var i = 0; i < option.length; i++)
	{
		document.write("<option value=" + 'option[i]' + ">"  + option[i] + "</option>");
	}
}

//Receving Info from dropdown menu
function getColor(color)
{
	colorCode = color.selectedIndex;
}
	
function getModel(model)
{
	modelCode = model.selectedIndex;
}

function findPrize(arg)
{
	var local = Math.round(Math.ceil(arg)/10);
	
	//local = local / 10;
	local = local - 4;
	
	if(local < 0)
	{
		local = 0;
	}
	
	return local;
}

function CheckBoundories(model, width, height)
{
	var errMSG = "Зададените размери са извън позволената ширина/височина на продукта";
	var J1ErrEisha = "За бамбук J1, J2, J3, J4, J5 и J6 (за система Ейша) максималната ширина е 180 см.";
	var B3ErrEisha = "За бамбук B3, B4, B5 и B6 (за система Ейша) максималната височина е 200 см.";
	var J1ErrFeba = "За бамбук J2, J5 и J6 (система Феба) максималната ширина е 180 см.";
	var B3ErrFeba = "За бамбук B3, B4, B5, ,B6, B7, B13 и D4 (система Феба) максималната ширина е 180 см.";
	var sqrtMeters = width * height / 10000;
	
	switch (model)
	{
		case 0:
		if(width > 240 || width < 35 || height > 250 || height < 40 || sqrtMeters > 5)
		{
			alert(errMSG);
		} 
		else if(colorCode < 6)
		{
			if (width > 180)
			{
			alert(J1ErrEisha);
			}
		}
		else if(colorCode == 7 || colorCode == 16 || colorCode == 17 || colorCode == 18)
		{
			if (height > 200)
			{
			alert(B3ErrEisha);
			}
		}
		break;
		
		case 1:
		if(width > 240 || width < 35 || height > 250 || height < 40 ||sqrtMeters > 4)
		{
			alert(errMSG);
		}
		else if(colorCode == 1 || colorCode == 4 || colorCode == 5)
		{
			if (width > 180)
			{
			alert(J1ErrFeba);
			}
		}
		else if (colorCode == 7 || colorCode == 16 || colorCode == 17 || colorCode == 18 || colorCode == 22 || colorCode == 24)
		{
			if (width > 180)
			{
			alert(B3ErrFeba);
			}
		}break;
	}
}

function printFinalPrice()
{
	var sizeWidth = document.getElementById("sunblindWidth").value; 
	var sizeHeight = document.getElementById("sunblindHeight").value;	
	var discount = 6;	//precent discount
	var colorGroup = 0;
	var colorExeptionMSG = "Бамбук J1, J3 и J4 не може да се изпълняват със система Феба.";
	
	CheckBoundories(modelCode, sizeWidth, sizeHeight);
	
	sizeWidth = findPrize(sizeWidth);
	sizeHeight = findPrize(sizeHeight);
	
	switch(modelCode)
	{
		case 0:
		totalPrice = eishaTable[sizeHeight][sizeWidth];
		break;
		
		case 1:
		totalPrice = febaTable[sizeHeight][sizeWidth];
		
		if(colorCode == 0 || colorCode == 2 || colorCode == 3)
		{
			alert(colorExeptionMSG);
		}break;
	}
	
	if (colorCode > 26)
	{
		colorGroup = 3;
	}
	else if (colorCode > 14)
	{
		colorGroup = 2;
	}
	else if (colorCode > 5)
	{
		colorGroup = 1;
	}
	else
	{
		colorGroup = 0;
	}
	
	totalPrice *= Coeficient[colorGroup];
	totalPrice -= totalPrice *  (discount /100);
	
	document.getElementById("finalPrice").innerHTML = totalPrice.toFixed(2) + " лв.";
	totalPrice = 0;
	return false;
}
